'''
2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна. Использовать формулу:
длина*ширина*масса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в 1 см*число см толщины полотна.
Проверить работу метода.
Например: 20м*5000м*25кг*5см = 12500 т
'''

class Road:

    _length = 0
    _width = 0

    def __init__(self, _length, _width, weight, depth):
        self._length = _length
        self._width = _width
        self.weight = weight
        self.depth = depth

    def mass(self):
        length_mass = self._length
        width_mass = self._width
        weight_mass = self.weight
        depth_mass = self.depth
        total_mass = length_mass * width_mass * weight_mass * depth_mass / 1000
        return print(f"Масса асфальта: {total_mass} т.")

road = Road(20, 5000, 25, 5)
road.mass()
